# Задача 14: Требуется вывести все целые степени двойки (т.е. числа
# вида 2**k), не превосходящие числа N.
# 10 -> 1 2 4 8

# Вариант с циклом for
N = int(input("Введите число: ")) 
print(f"{N} ->", end = " ")        # для вывода строки согласно ТЗ " 10 -> 1 2 4 8"
for i in range(N):
    square = 2 ** i
    if square > N:
        break
    print(f"{square}", end = " ") # для вывода строки согласно ТЗ " 10 -> 1 2 4 8"

# Вариант с циклом while
# N = int(input('Введи число N: '))
# i = 0
# print(f"{N} ->", end = " ")
# while 2 ** i <= N:
#     print(2**i, end = " ")
#     i += 1